<template>
  <div class="history-page page">
    <div class="history-page-container container">
      <h1 class="history-page-container__title page-title">О больнице</h1>

      <h2>
        История Луганской государственной многопрофильной больницы №3: Прошлое,
        Настоящее, Будущее
      </h2>
      <img
        src="./../../assets/images/history/main-build.jpeg"
        alt="main-build"
      />
      <p>
        Основанная в сердце Луганска, государственная многопрофильная больница
        №3 обладает богатой историей, отражающей не только медицинский прогресс,
        но и дух преодоления трудностей в условиях переменчивой судьбы. Эта
        историческая справка приглашает вас отправиться в увлекательное
        путешествие через времена и события, которые сделали нашу больницу тем,
        чем она является сегодня.
      </p>
      <!-- <h2>Времена Изменений и Преодоления</h2> -->
      <p>
        В прошлом веке наша больница столкнулась с серьезными вызовами, включая
        периоды социальных и экономических перемен. Несмотря на это, врачи,
        медицинский персонал и администрация с гордостью продолжали оказывать
        помощь пациентам, ставя их здоровье и благополучие в приоритет.
      </p>
      <!-- <h2>Развитие и Современность</h2> -->
      <p>
        С приходом нового тысячелетия Луганская государственная многопрофильная
        больница №3 вошла в эпоху современных технологий и передовых методик. За
        годы своей деятельности она стала одним из центров медицинского
        инновационного развития, предоставляя доступ к самым современным методам
        диагностики и лечения.
      </p>
      <!-- <h2>Будущее и Продолжение Миссии</h2> -->
      <p>
        В нашем будущем мы видим продолжение нашей миссии - предоставление
        качественной медицинской помощи, сочетая ее с человеческим отношением и
        заботой о пациентах. Мы стремимся к дальнейшему росту, развитию и
        инновациям, чтобы оставаться надежным опорным пунктом для тех, кто ищет
        поддержку и уход в сфере здоровья.
      </p>
      <p>
        Луганская государственная многопрофильная больница №3 - это не только
        здания и оборудование, но и наша история, наш опыт и наше стремление
        делать мир здоровее. Мы благодарим всех, кто поддерживал нас на этом
        пути, и приглашаем вас быть свидетелями нашего непрерывного роста и
        развития.
      </p>
    </div>
  </div>
</template>
<style lang="scss">
.history-page {
  &-container {
    &__title {
      margin-bottom: 50px;
    }
    h2 {
      color: $title-color;
      margin-bottom: 20px;
    }
    p {
      text-align: justify;
      line-height: 22px;
      margin-bottom: 30px;
      color: rgba(0, 0, 0, 0.9);
    }
    img {
      margin-right: 20px;
      float: left;
      width: 50%;
      height: auto;
    }
  }
}
@media screen and (max-width: 763px) {
  .history-page {
    &-container {
      &__title {
        margin-bottom: 20px;
      }
      h2 {
        color: $title-color;
        margin-bottom: 10px;
      }
      p {
        margin-bottom: 15px;
      }
      img {
        width: 100%;
      }
    }
  }
}
</style>
